In [132]:
import requests
r = requests.post('http://127.0.0.1:4444/is-fraud', 
                  json = {"step":1,"type":"TRANSFER","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0}
                 )

In [133]:
r.json()

{'isFraud': '[False]'}

In [202]:
json = {"step":1,"type":"TRANSFER","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0}
data = pd.DataFrame(json, index=[0])

In [189]:
data

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,1.0

In [153]:
data.groupby(data.columns.tolist(),as_index=False).size()

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,size
0,1,CASH_OUT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,1

In [146]:
new_data= pd.concat([data,data], axis=0)
new_data

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0

In [136]:
def addToFile(file, what):
    f = open(file, 'a').write(what)

In [138]:
addToFile('file_name.csv', data)

TypeError: write() argument must be str, not DataFrame

In [140]:
file_obj  = open("file_name.csv", "w+")

In [190]:
import os.path
file_exists = os.path.isfile('file_name.csv') 

if file_exists:
    temp = pd.read_csv('file_name.csv')
    new_data = pd.concat([temp,data],axis=0)
    new_data.to_csv('file_name.csv', index=False) 
else:
    data.to_csv('file_name.csv', index=False)

In [191]:
new_df = pd.read_csv('file_name.csv')

group = new_df.groupby(new_df.columns.tolist(),as_index=False).size().reset_index()

In [195]:
group

,index,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,size
0,0,1,CASH_OUT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,1
1,1,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,4
2,2,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,1.0,1

In [199]:
group2 = group.loc[:,group.columns!="type"]

In [200]:
group2

,index,step,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,size
0,0,1,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,1
1,1,1,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,4
2,2,1,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,1.0,1

In [194]:
group.columns.isin(['size'])

array([False, False, False, False, False, False, False, False, False,
       False,  True])

In [206]:
pd.merge(group,data)['size']<3

0    False
Name: size, dtype: bool

In [155]:
file_obj.close()

In [124]:
json = {"step":1,"type":"TRANSFER","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0}

In [128]:
temp = pd.DataFrame(json, index=[0])

In [129]:
temp

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0

In [130]:
temp['isFraud']= str('[False]')

In [131]:
temp

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,[False]

In [122]:
import pandas as pd
import requests
json_ = {"step":1,"type":"TRANSFER","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0},{"step":1,"type":"PAYMENT","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0},{"step":1,"type":"CASH_OUT","amount":9839.64,"nameOrig":"C1231006815","oldbalanceOrig":170136.0,"newbalanceOrig":160296.36,"nameDest":"M1979787155","oldbalanceDest":0.0,"newbalanceDest":0.0}
            
#query = pd.DataFrame.from_dict(json)
#query = pd.DataFrame.from_dict(json,orient='columns')

In [123]:
list(json_)

[{'step': 1,
  'type': 'TRANSFER',
  'amount': 9839.64,
  'nameOrig': 'C1231006815',
  'oldbalanceOrig': 170136.0,
  'newbalanceOrig': 160296.36,
  'nameDest': 'M1979787155',
  'oldbalanceDest': 0.0,
  'newbalanceDest': 0.0},
 {'step': 1,
  'type': 'PAYMENT',
  'amount': 9839.64,
  'nameOrig': 'C1231006815',
  'oldbalanceOrig': 170136.0,
  'newbalanceOrig': 160296.36,
  'nameDest': 'M1979787155',
  'oldbalanceDest': 0.0,
  'newbalanceDest': 0.0},
 {'step': 1,
  'type': 'CASH_OUT',
  'amount': 9839.64,
  'nameOrig': 'C1231006815',
  'oldbalanceOrig': 170136.0,
  'newbalanceOrig': 160296.36,
  'nameDest': 'M1979787155',
  'oldbalanceDest': 0.0,
  'newbalanceDest': 0.0}]

In [108]:
pd.DataFrame(list(json_))

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0
1,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0
2,1,CASH_OUT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0

In [90]:
r1 = requests.post('http://127.0.0.1:9999/is-fraud', json = json_)

In [91]:
r1.json()

{'isFraud': '["[False]", "[False]"]'}

In [26]:
len_ = len(json_)
print(len_)

3

In [27]:

for i in range(0,5):
    if i%2==0:
        print('yes')
    else:
        print('no')

yes
no
yes
no
yes

In [28]:
import numpy as np
query = pd.DataFrame(json_, index=np.arange(len_))
query

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0
1,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0
2,1,CASH_OUT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0

In [34]:
query.iloc[0]

step                        1
type                 TRANSFER
amount                9839.64
nameOrig          C1231006815
oldbalanceOrig       170136.0
newbalanceOrig      160296.36
nameDest          M1979787155
oldbalanceDest            0.0
newbalanceDest            0.0
Name: 0, dtype: object

In [29]:
temp = query[0:1]
temp

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0

In [30]:
results = list(["False", "False", "False"])
results = pd.DataFrame(results, columns=['isFraud'])
results

  isFraud
0   False
1   False
2   False

In [28]:
# merger = pd.concat([query, results], axis=1)
merger

,step,type,amount,nameOrig,oldbalanceOrig,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud
0,1,TRANSFER,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,False
1,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,False
2,1,CASH_IN,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,False

In [49]:
import joblib

clf = joblib.load("model.pkl") # Load "model.pkl"
print ('Model loaded')
model_columns = joblib.load("model_columns.pkl") # Load "model_columns.pkl"
print ('Model columns loaded')

Model loaded
Model columns loaded

In [53]:

input_ = pd.DataFrame(json_, index=np.arange(len_))
query = input_.drop(['nameOrig', 'nameDest'], axis = 1)

query['type'] = np.where((query.type == 'TRANSFER'),int(0),query['type'])
query['type'] = np.where((query.type == 'CASH_OUT'),int(1),query['type'])

query.loc[(query.oldbalanceDest == 0) & (query.newbalanceDest == 0) & (query.amount != 0), ['oldbalanceDest', 'newbalanceDest']] = -1
query.loc[(query.oldbalanceOrig == 0) & (query.newbalanceOrig == 0) & (query.amount != 0), ['oldbalanceOrig', 'newbalanceOrig']] = np.nan
query['errorbalanceOrig'] = query.newbalanceOrig + query.amount - query.oldbalanceOrig
query['errorbalanceDest'] = query.oldbalanceDest + query.amount - query.newbalanceDest

df = pd.DataFrame([])
result = np.array([])

for i in range(0,len_):
    
    if ((query.type.iloc[i] == int(0)) | (query.type.iloc[i] == int(1))):
        prediction = list(clf.predict(query[i:i+1]))
        prediction = list(bool(x) for x in prediction)
        result = np.append(result,str(prediction)) 
        
    else:
        result = np.append(result,str('[False]'))
        
    
    results = pd.DataFrame(result, columns=['isFraud'])
#     df = pd.concat([input_, results],axis=1)
#     df.to_csv('file_name.csv', index=False)    

# result = result.tolist()
# json_format = json.dumps(result)

if cond
else cond
if cond

In [69]:
result = np.array([])
result

array([], dtype=float64)

In [76]:
prediction = list(clf.predict(query[0:1]))
prediction = list(bool(x) for x in prediction)

In [79]:
result = np.append(result,str(prediction)) 
result

array(['0.0', '0.0', '0.0', '0.0', '0.0', '[[False]]', '[False]'],
      dtype='<U32')

In [127]:
result= str('[False]')